[
    {
        "id": 266641,
        "lang": "da",
        "online": "y",
        "value": 1,
        "title": "Praktikstart",
        "subtitle": "Uge 1 & 2",
        "date": "20/08/22",
        "week": "1 & 2",
        "desc": "Intro & projekt Efter mødet mandag morgen, blev jeg introduceret for nogle praktikanter, blandt andet to som jeg skal arbejde sammen med på et projekt. De andre praktikanter sidder på kontoret i København, så vores samarbejde foregår over Teams. Ud over projektet, har vi i dagligt haft flere møder, afholdt af forskellige personer fra AKQA, som fortæller om firmaet, deres kunder og hvordan de arbejder. Week 1 - Planning & managing Week 2 - Design & UX Week 3 -  Markup Week 4 - Performance & CMS Week 5 - JS & frameworks, API dev. Week 6 - Presentation Vores projekt er et 6-ugers intro-projekt som AKQA har lavet, kaldet ''Flight to orbit''. Projektet handler om et firma kaldet Space Debris Inc. (SD), i året 2122. SD sørger for at hente folks skrald, og skille sig af med det, ved at smide det ud i rummet. Vores opgave er så, at skabe et brand til firmaet, samt en web-app med: en landingpage, content page, webshop og admin page. I denne uge har vi været i gennem den første uge af projektet, hvor vi har sørge for planlægning og administrationen af projektet. Jeg må indrømme at jeg nok er lidt utålmodig, og jeg glæder mig til at kunne komme i gang med at programmere, men det er også vigtigt at respektere at alt tager sin tid, og ikke skal hundses med. Vi har fået rimeligt frie tøjler, og har lov til at tage både kreativ og humoristisk frihed, og indtil videre virker det rigtigt sjovt. Jeg er spændt på at se hvad vi kan få kreeret. De to andre praktikanter, som jeg arbejder med virker begge super dygtige. Den ene er en multimediedesigner, specialiserende i frontend ligesom mig, og den anden er en datamatiker.",
        "descHtml": "<div class='article-text-section'><p>Mandag d. 8 august kunne jeg endelig skyde min praktikperiode i gang, hos AKQA. Jeg skulle oprindeligt først starte d. 15 august, men fik lov til at starte en uge før med selvstudie, for at få ugerne til at gå mest muligt op.</p><p>Til mit selvstudie havde jeg forberedt lidt forskelligt materiale som jeg ville kigge på, i form af nogle kurser på Linkedin Learning og Skillshare, samt nogle anbefalede videoer på youtube.</p></div><div class='article-section'><div class='article-box'><p><span>MAN -</span> React.js + Sass/SCSS</p><p><span>TIR -</span> Next.js</p><p><span>ONS -</span> Next.js fortsat</p><p><span>TOR -</span> Vue.js</p><p><span>FRE -</span> Vue.js fortsat</p></div><h4>Selvstudie</h4><p>Jeg startede ugen ud med noget React, som jeg har et godt kendskab til i forvejen, samt noget Sass, som jeg kendte lidt til i forvejen.</p><p>Derefter brugte jeg tirsdag og onsdag på Next, som jeg ikke havde nogen kendskab til i forvejen, men da det ligner React rigtigt meget, føler jeg hurtigt at jeg forstod det.</p><p>Torsdag og Fredag brugte jeg på Vue, som ikke ligner noget programmerings sprog jeg har brugt før, dog virker det umiddelbart simpelt, og jeg føler at jeg let forstod de basale dele af det.</p></div><div class='article-text-section'><h4>Første dag på kontoret</h4><div class='img-cntr'><img src='/data/media/posts/toldboden.png' alt=''></div><p>Mandag d. 15 august klokken 0830, skulle jeg endeligt møde op til min første dag ved AKQA, i Toldboden. Jeg stod op klokken 0600 og følte mig frisk, nervøs og spændt på samme tid, på trods af at jeg næsten ikke kunne sove.</p><p>Da jeg mødte ind blev jeg taget godt imod, og fik hilst på en masse fra kontoret, heri blandt min mentor. Min Mentor viste mig hen til mit skrivebord og hjalp mig med at få sat computeren op, så den havde alt jeg skulle bruge af programmer og logins. Derefter fik vi morgenmad i køkkenet, hvor jeg fik hilst på lidt flere fra kontoret.</p><p>Hver mandag bliver der holdt et fællesmøde, hvor vi går igennem hvem der arbejder på hvad for ugen. Det var spændende at se den lange liste af firmaer som der arbejdes for, samt at høre kort om hvad nogle af projekterne går ud på.</p></div><div class='article-text-section'><h4>Intro & projekt</h4><p>Efter mødet blev jeg introduceret for to andre praktikanter jeg skal arbejde sammen med, og det projekt vi skal arbejde på. De sidder på kontoret i København, så vores samarbejde foregår over Teams.<br>Ud over projektet, har vi i dagligt haft flere møder, afholdt af forskellige personer fra AKQA, som fortæller om firmaet, deres kunder, hvordan de arbejder osv.</p><div class='article-section'><div class='article-box'><p><span>Week 1 -</span> Planning & managing</p><p><span>Week 2 -</span> Design & UX</p><p><span>Week 3 -</span> Markup</p><p><span>Week 4 -</span> Performance & CMS</p><p><span>Week 5 -</span> JS & frameworks, API dev.</p><p><span>Week 6 -</span> Presentation</p></div><p>Vores projekt er et 6-ugers intro-projekt som AKQA har lavet, kaldet ''Flight to orbit''. Projektet handler om et firma kaldet Space Debris Inc. (SD), i året 2122.</p><p>SD sørger for at hente folks skrald, og skille sig af med det, ved at smide det ud i rummet. Vores opgave er så, at skabe et brand til firmaet, samt en web-app med: en landingpage, content page, webshop og admin page.</p><p>I denne uge har vi været i gennem den første uge af projektet, hvor vi har sørge for planlægning og administrationen af projektet. Jeg må indrømme at jeg nok er lidt utålmodig, og jeg glæder mig til at kunne komme i gang med at programmere, men det er også vigtigt at respektere at alt tager sin tid, og ikke skal hundses med.</p></div><p>Vi har fået rimeligt frie tøjler, og har lov til at tage både kreativ og humoristisk frihed, og indtil videre virker det rigtigt sjovt.</p><p>Jeg er spændt på at se hvad vi kan få kreeret. De to andre praktikanter, som jeg arbejder med virker begge super dygtige. Den ene er en multimediedesigner, specialiserende i frontend ligesom mig, og den anden er en datamatiker.</p></div>",
        "short": "Mandag d. 8 august kunne jeg endelig skyde min praktikperiode i gang, hos AKQA. Jeg skulle oprindeligt først starte d. 15 august, men fik lov til at starte en uge før med selvstudie, for at få ugerne til at gå mest muligt op. Til mit selvstudie havde jeg forberedt lidt forskelligt materiale som jeg ville kigge på...",
        "shortHtml": "<p>Mandag d. 8 august kunne jeg endelig skyde min praktikperiode i gang, hos AKQA. Jeg skulle oprindeligt først starte d. 15 august, men fik lov til at starte en uge før med selvstudie, for at få ugerne til at gå mest muligt op.</p><p>Til mit selvstudie havde jeg forberedt lidt forskelligt materiale som jeg ville kigge på...</p>",
        "tags": [
            {"tag": null},
            {"tag": null}
        ],
        "imgs": [
            { 
                "imgId": 197977,
                "imgSrc": "/data/media/posts/akqalogo.jpeg",
                "imgAlt": "AKQA",
                "imgDesc": "AKQA white logo"
            },
            { 
                "imgId": 657940,
                "imgSrc": "/data/media/posts/toldboden.png",
                "imgAlt": "Toldboden",
                "imgDesc": "Toldboden"
            },
            { 
                "imgId": 613742,
                "imgSrc": "/data/media/posts/share-600.png",
                "imgAlt": "AKQA",
                "imgDesc": "AKQA logo"
            },
            { 
                "imgId": 766792,
                "imgSrc": "/data/media/posts/code-cover1.png",
                "imgAlt": "Code",
                "imgDesc": "Code"
            }
        ]

    },


    {
        "id": 727236,
        "lang": "da",
        "online": "y",
        "value": 2,
        "title": "Praktik",
        "subtitle": "Uge 3 & 4",
        "date": "02/09/22",
        "week": "Uge 3 & 4",
        "desc": "Description",
        "descHtml": "<div class='article-text-section'> <p>Mandag d. 22 er starten på min 3. uge i praktikken, og jeg er så småt begyndt at føle jeg er faldet til, selvom jeg kan mærke jeg stadigt er meget genert blandt alle de nye mennesker, heldigvis er alle super søde, nede på jorden og gode til at joke med hinanden. Alt i alt er det et super dejligt kontor jeg er havnet i!</p> </div> <div class='article-text-section'> <h4>Uge 3</h4> <p> I denne uge kunne min projektgruppe og jeg endeligt gå i gang med design-delen af projektet Space Debris Inc. Vores forrige uge var meget mere løs og en general into, i denne uge har vi bestemt haft mere at se til, i form af skitser, mockups, moodboards, wireframes, mockups og logodesign. Vi har fået en ny ''uge-ansvarlig'', som i denne uge var Nicklas. Vi har en ny hver uge for at møde og arbejde med forskellige ''team-leads'', sidste uges uge-ansvarlige var Simon H. </p> <p> Mandagen havde mig gruppe og jeg et møde sammen med vores uge-ansvarlige, Nicklas. Her snakkede vi om hvad vi havde lavet indtil videre, hvordan det gik, hvad vi skal i denne uge osv. </p> <p> Nicklas foreslog at ham og jeg kunne tage til København og se kontoret der ovre, samt give mig muligheden for at møde de andre praktikanter som jeg har arbejdet sammen med. Hos AKQA Denmark er det nemt at kunne rejse mellem de to kontorer for at arbejde, hvilket jeg synes er super fedt, da jeg kan forestille mig at det fremmer samarbejdet mellem kontorene en del. </p> <p> Nicklas fik arengeret turen til København, og tidligt onsdag morgen tog jeg afsted med toget fra Aarhus Hovedbanegård, med en dejlig plads i 1' klasse. Nicklas hoppede med på toget i Frederecia, og så gik turen ellers mod København. det var super fedt at få lov til at hilse på de andre praktikanter, men også at se kontoret i København, og bruge lidt tid der ovre. </p> </div> <div class='article-text-section'> <h4>Amsterdam</h4> <div class='img-cntr'> <img src='/data/media/posts/amsterdamhuse.jpg' alt='amsterdam huse'/> </div> <p> Uge 3 sluttede med en tur til Amsterdam, fra fredag d. 26 til søndag d. 28. Hvert år tager AKQA på en firmarejse i en weekend, sidste år var de f.eks. i Berlin. Jeg var så heldig at få lov til at komme med! De sørgede for fly og hotel, samt aftensmad lørdag aften. </p> <p> Vi landede med flyet i Amsterdam omkring klokken 11, og var fremme ved hotellet ca. en time senere. Jeg havde forventet at jeg skulle dele værelse med nogen, men nej-nej, jeg fik mit eget med en stor lækker seng og lækkert badeværelse! </p> <p> Fredagen blev hovedsagligt brugt på at gå lidt rundt i området og se lidt af byen, nogen havde planer, selv skulle jeg i et escape room med nogle af de andre. Om aftenen var vi inviteret til fest ved noget der hed Waterkant, hvor der var fri bar til alle fra AKQA. </p> <p> Lørdag var endnu en rolig dag, den lignede meget dagen før. Om eftermiddagen tog jeg på museeum med en anden fra kontoret, hvilket var super fedt. Lørdag aften var der en firma-event i SkyLounge Amsterdam, det havde en fantastisk udsigt over Amsterdam! Det var meget fancy og exclusivt, så jeg følte mig en smule under-dressed i mine jeans, t-shirt og åbne skovmands-skjorte... Heldigvis så jeg hurtigt mange i lignende tøj, så helt ved siden af var jeg ikke! </p> <div class='img-cntr'> <img src='/data/media/posts/img_20220827_191229e.jpg' alt='skylounge amsterdam'/> </div> </div> <div class='article-text-section'> <h4>Uge 4</h4> <p> Uge 4 startede vi op igen klar og friske (nogenlunde da) mandag morgen, hvor vi nu kunne få lov til at gå i gang med at kigge på noget programmering! Denne uges uge-ansvarlige er Simon (En anden Simon end den tidligere uge-ansvarlige). </p> <p> Mandag gav Simon et hurtigt crash-course i Next bygget med TypeScript, da det er dét vi skal bruge til at lave vores projekt. Der var jeg glad for at jeg havde kigget på det i forvejen, for selvom det ligner React ret meget - da det er bygget på det, er der selvfølgeligt stadigt nogle ting som skal gøres anderledes. </p> <p> Tirisdag gav Simon os et crash-course i Chakra UI, som til gengæld er noget helt nyt for mig. Det er et library som man kan bruge til React, til at style componenter og moduler nemt og hurtigt. <br/> Onsdag kiggede på vi data-flow i Next, og hvordan man bedst binder det sammen med en REST API, og for det renderet bedst muligt. </p> <p> Min multimediedesigner makker i gruppen havde haft mere besvær med Chakra UI end hvad var nyttigt, og havde desværre ikke haft oplevelsen af at det skulle gøre det nemmere og hurtigere at bygge web apps. Jeg har heldigvis været heldig, og siddet lige bag ved Simon, og derved haft let ved at søge hjælp. <br/> Vi har derfor spurgt om lov til at få indkorporeret lidt sass i projektet, til at lette frustrationerne og få styr på stylingen. </p>",
        "short": " Mandag d. 22 er starten på min 3. uge i praktikken, og jeg er så småt begyndt at føle jeg er faldet til, selvom jeg kan mærke jeg stadigt er meget genert blandt alle de nye mennesker, heldigvis er alle super søde, nede på jorden og gode til at joke med hinanden. Alt i alt er det et super dejligt kontor jeg er havnet i! I denne uge kunne min projektgruppe og jeg endeligt gå i gang med design-delen af projektet Space Debris Inc. Vores forrige uge var meget mere løs og en general into, i denne uge har vi bestemt haft mere at se til, i form af skitser, mockups, moodboards, wireframes, mockups og logodesign. Vi har fået en ny ''uge-ansvarlig'', som i denne uge var Nicklas. Vi har en ny hver uge for at møde og arbejde med forskellige ''team-leads'', sidste uges uge-ansvarlige var Simon H.",
        "shortHtml": " <p>Mandag d. 22 er starten på min 3. uge i praktikken, og jeg er så småt begyndt at føle jeg er faldet til, selvom jeg kan mærke jeg stadigt er meget genert blandt alle de nye mennesker, heldigvis er alle super søde, nede på jorden og gode til at joke med hinanden. Alt i alt er det et super dejligt kontor jeg er havnet i!</p> <p> I denne uge kunne min projektgruppe og jeg endeligt gå i gang med design-delen af projektet Space Debris Inc. Vores forrige uge var meget mere løs og en general into, i denne uge har vi bestemt haft mere at se til, i form af skitser, mockups, moodboards, wireframes, mockups og logodesign. Vi har fået en ny ''uge-ansvarlig'', som i denne uge var Nicklas. Vi har en ny hver uge for at møde og arbejde med forskellige ''team-leads'', sidste uges uge-ansvarlige var Simon H. </p>",
        "tags": [
            {"tag": null},
            {"tag": null}
        ],
        "imgs": [
            { 
                "imgId": 768008,
                "imgSrc": "/data/media/posts/amsterdamå.jpg",
                "imgAlt": "",
                "imgDesc": ""
            },
            { 
                "imgId": 284448,
                "imgSrc": "/data/media/posts/amsterdamhuse.png",
                "imgAlt": "",
                "imgDesc": ""
            },
            { 
                "imgId": 923433,
                "imgSrc": "/data/media/posts/amsterdamgade .png",
                "imgAlt": "",
                "imgDesc": ""
            },
            { 
                "imgId": 318375,
                "imgSrc": "/data/media/posts/code-cover1.png",
                "imgAlt": "",
                "imgDesc": ""
            }
        ]
    },

    {
        "id": 837236,
        "lang": "da",
        "online": "y",
        "value": 3,
        "title": "projektarbejde",
        "subtitle": "Uge 5 & 6",
        "date": "16/09/22",
        "week": "Uge 5 & 6",
        "desc": "Description",
        "descHtml": "<div class='article-content'> <div class='article-text-section'> <p> 5. og 6. uge af praktikken er nu kommet og gået, og vi er ved at være i slutspurten af vores intro-projekt. Jeg får lært en masse om Next JS, TypeScript og Chakra UI igennem en masse ''trial and error'', men ikke uden succes og gennembrud. </p> </div> <div class='article-text-section'> <h4>Uge 5</h4> <p> Det var meningen at denne uge skulle handle om backend-delen, men den developer som skulle give os introen og var den ugeansvarlige var desværre syg, og blev udskudt fra mandagen til senere på ugen. Vi fortsatte bare hvor vi slap ugen før, indtil vi fik en intro. Introen var dog ikke en dybtegående, men det overordnede som vi havde brug for at vide - Især for mig og min frontend-makker, da vi ikke skal arbejde med det, men forstå det godt nok til at kunne flette front- og backenden sammen. </p> <p> I denne uge stod det for mig mest på at få Next JS, TypeScript (TS) og Chakra UI til at spille. Next og TS har været meget lige til, uden for mange bump på vejen. Den store forskel fra React til Next, er at React er CSR (Client Side Rendering), som sender JavaScript af sted, der læses af klienten, og derefter renderes. Next er SSR (Server Side Rendering), hvor serveren læser JavaScripten, således det er klar til at renderes af klienten når siden tilgåes. </p> <p> Jeg har stået for en content-page, som skal vise diverse små cards/artikler og tekst om det fiktive firma 'Space Debris Inc' samt en sektion med firmaets medarbejdere. <br/> Derudover stod jeg også for en admin-page, hvor ad administrator kan se en oversigt over salg der foregår på hjemmesiden, samt nogle statistikker over det. Derudover kan administratoren se virksomhedens raketter, og diverse info om dem, så som deres current capacity, max capacity, available/unavailable, status, next launch, previous launch. Administratoren skal også gerne kunne redigere, tilføje nye eller slette raketter. </p> <p> Målet er at hele siden skal være headless, og kunne hentes fra en CMS, i dette tilfælde er det Umbraco der skal bruges, som vores backend developer står for. Vi vil få nogle endpoints, som vi så skal fetche dataen fra. Dataen vil komme til os og blive læst som JSON, så helt fremmed kommer det ikke til at være, at implementere (forhåbenligt!). </p> </div> <div class='article-text-section'> <h4>Uge 6</h4> <p> Uge 6 flød meget sammen med uge 5, da det stortset var det samme vi arbejde med. Jeg er stadigt i gang med både content og admin-siderne. <br/> Jeg har fået lavet noget mock-data, i form af en JSON-fil jeg har liggende lokalt, som jeg kan bruge til mine sider, indtil jeg får noget data fra backenden. Det var meningen at jeg gerne skulle have fået det i løbet af denne uge, men nogle af tingene tager desværre bare lidt længere tid og/eller driller - som kode jo har det med at gøre. <br/> Det meste af tiden bruger jeg på at få skabt et større kendskab til Chakra UI og TypeScript. Heldigvis er jeg lige så stille ved at føle mig mere komfortabel og sikker med Next JS. </p> <p> Jeg kan mærke at jeg så småt er begyndt at føle mig lidt stresset og presset, da det er torsdag i næste uge vi skal præsentere vores produkt for hele Aarhus kontoret + lidt folk fra København. Jeg havde håbet på at være tættere på noget færdigt og mere funtionelt end det er nu, da raket-siden under admin-siden er lidt svær at få skabt noget funtionalitet til med mock-dataen. Jeg forsøger at gøre brug af Next's API, men det er ikke noget jeg har brugt før, og indtil videre lidt svær at få op og køre, men forhåbenligt når jeg det, da jeg føler raket-siden er en essentiel del af admin-siden. </p> <p> Heldigvis er de omkring mig på kontoret søde til at sige at det er helt fint det ikke bliver helt færdigt, vi er trods alt kun 3 praktikanter, hvor backend developeren ikke har arbejdet med den slags kode før, jeg har kun brugt Next en lille smule før jeg startede (i selvstudiet), som gav mig et lille forspring, ellers er det nyt for min frontend-makker samt TypeScript og Chakra UI er nyt for os begge. </p> </div> </div>",
        "short": "Short",
        "shortHtml": " <p>5. og 6. uge af praktikken er nu kommet og gået, og vi er ved at være i slutspurten af vores intro-projekt. Jeg får lært en masse om Next JS, TypeScript og Chakra UI igennem en masse ''trial and error'', men ikke uden succes og gennembrud. </p> ",
        "tags": [
            {"tag": null},
            {"tag": null}
        ],
        "imgs": [
            { 
                "imgId": 768008,
                "imgSrc": "/data/media/posts/code-cover.png",
                "imgAlt": "",
                "imgDesc": ""
            },
            { 
                "imgId": 284448,
                "imgSrc": "/data/media/posts/code-cover1.png",
                "imgAlt": "",
                "imgDesc": ""
            },
            { 
                "imgId": 923433,
                "imgSrc": "/data/media/posts/code-cover1.png",
                "imgAlt": "",
                "imgDesc": ""
            },
            { 
                "imgId": 318375,
                "imgSrc": "/data/media/posts/code-cover1.png",
                "imgAlt": "",
                "imgDesc": ""
            }
        ]
    }
  ]